src/InformationRegisters/НастройкиИнтеграцииSlack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииSlack</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока20</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекИнтеграцииSlack</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыНастроекИнтеграцииSlack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНастроекИнтеграцииSlack</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПользовательId</Name>
					<Comment>Идентификатор пользователя в Slack</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольноеЧисло</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/НастройкиИнтеграцииSlack/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначениеНастройки(знач ПользовательСсылка, знач НастройкаСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка"		, НастройкаСсылка);
	Запрос.УстановитьПараметр("Пользователь"	, ПользовательСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииSlack.Настройка КАК Настройка,
	|	НастройкиИнтеграцииSlack.ЗначениеСтрока20 КАК ЗначениеСтрока20,
	|	НастройкиИнтеграцииSlack.ЗначениеСтрока КАК ЗначениеСтрока,
	|	НастройкиИнтеграцииSlack.ЗначениеЧисло КАК ЗначениеЧисло,
	|	НастройкиИнтеграцииSlack.ЗначениеДата КАК ЗначениеДата,
	|	НастройкиИнтеграцииSlack.ЗначениеСсылка КАК ЗначениеСсылка,
	|	НастройкиИнтеграцииSlack.ЗначениеБулево КАК ЗначениеБулево,
	|	НастройкиИнтеграцииSlack.ИмяРесурса КАК ИмяРесурса,
	|	НастройкиИнтеграцииSlack.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииSlack КАК НастройкиИнтеграцииSlack
	|ГДЕ
	|	НастройкиИнтеграцииSlack.Настройка = &Настройка
	|	И НастройкиИнтеграцииSlack.Пользователь = &Пользователь";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка[Выборка.ИмяРесурса];
КонецФункции

Функция ПолучитьЗначенияНастроек(знач ПользовательСсылка, знач НастройкиКакСсылки = Ложь, знач ТолькоЗначения = Истина) Экспорт
	Если НастройкиКакСсылки Тогда
		ЗначенияНастроек = Новый Соответствие; 
	Иначе 
		ЗначенияНастроек = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ПользовательСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииSlack.Настройка КАК Настройка,
	|	НастройкиИнтеграцииSlack.ЗначениеСтрока20 КАК ЗначениеСтрока20,
	|	НастройкиИнтеграцииSlack.ЗначениеСтрока КАК ЗначениеСтрока,
	|	НастройкиИнтеграцииSlack.ЗначениеЧисло КАК ЗначениеЧисло,
	|	НастройкиИнтеграцииSlack.ЗначениеДата КАК ЗначениеДата,
	|	НастройкиИнтеграцииSlack.ЗначениеСсылка КАК ЗначениеСсылка,
	|	НастройкиИнтеграцииSlack.ЗначениеБулево КАК ЗначениеБулево,
	|	НастройкиИнтеграцииSlack.ИмяРесурса КАК ИмяРесурса,
	|	НастройкиИнтеграцииSlack.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииSlack КАК НастройкиИнтеграцииSlack
	|ГДЕ
	|	НастройкиИнтеграцииSlack.Пользователь = &Пользователь";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ЗначенияНастроек;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Настройка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкиКакСсылки Тогда
			КлючЗначения = Выборка.Настройка;
		Иначе 
			КлючЗначения = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Настройка);
		КонецЕсли;
		
		ЗначениеНастройки = Выборка[Выборка.ИмяРесурса];
		
		Если ТолькоЗначения Тогда
			ЗначенияНастроек.Вставить(КлючЗначения, ЗначениеНастройки);
		Иначе 
			СтруктураЗначения = Новый Структура("Значение, Представление",
				ЗначениеНастройки,
				Выборка.Представление);
			ЗначенияНастроек.Вставить(КлючЗначения, СтруктураЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияНастроек;
КонецФункции

Функция УстановитьЗначениеНастройки(знач ПользовательСсылка, знач НастройкаСсылка, знач Значение) Экспорт
	ПараметрыНастройки = Перечисления.ВидыНастроекИнтеграцииSlack.ПолучитьДанныеНастройки(НастройкаСсылка);
	
	ЗаписьРегистра = РегистрыСведений.НастройкиИнтеграцииSlack.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Пользователь = ПользовательСсылка;
	ЗаписьРегистра.Настройка	= НастройкаСсылка;
	ЗаписьРегистра[ПараметрыНастройки.ИмяРесурса] = Значение;
	ЗаписьРегистра.ИмяРесурса	= ПараметрыНастройки.ИмяРесурса;
	ЗаписьРегистра.Записать(Истина);
КонецФункции

Функция ПолучитьПользователяПоКонтрольномуЧислу(знач КонтрольноеЧисло) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка"		, Перечисления.ВидыНастроекИнтеграцииSlack.КонтрольноеЧисло);
	Запрос.УстановитьПараметр("ЗначениеЧисло"	, ?(ТипЗнч(КонтрольноеЧисло) = Тип("Число"), КонтрольноеЧисло, Число(КонтрольноеЧисло)));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииSlack.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииSlack КАК НастройкиИнтеграцииSlack
	|ГДЕ
	|	НастройкиИнтеграцииSlack.Настройка = &Настройка
	|	И НастройкиИнтеграцииSlack.ЗначениеЧисло = &ЗначениеЧисло";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();  
	
	Возврат Выборка.Пользователь;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
